davidanson.vscode-markdownlint
eamodio.gitlens
exiahuang.dictionary
github.copilot
github.copilot-chat
jebbs.markdown-extended
manuth.markdown-converter
ms-dotnettools.csdevkit
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-dotnettools.vscodeintellicode-csharp
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.hexeditor
mushan.vscode-paste-image
perkovec.emoji
streetsidesoftware.code-spell-checker
telesoho.vscode-markdown-paste-image
twxs.cmake
yzhang.dictionary-completion
yzhang.markdown-all-in-one
